#### **1. What is the average TotalPayBenefits for each JobTitle? exclude ('Not Provided', 'Not provided')**

#### **2. Show The JobTitle and Overtime Pay for All Employees With Overtime Pay greater than 50000**

#### **3. What is the total number of unique employees? exclude ('Not Provided', 'Not provided')**

#### **4.Show The Top 10 highest Paid Employees**

#### **5.Show All Employees Ordered By Their TotalPay Benefits In Descending Order**

In [1]:
import sqlite3 as sql
import pandas as pd

In [2]:
conn = sql.connect('database.sqlite')
conn

In [6]:
pd.read_sql_query("SELECT * FROM sqlite_master WHERE type='table';", conn)

,type,name,tbl_name,rootpage,sql
0,table,Salaries,Salaries,2,CREATE TABLE Salaries (\n Id INTEGER PRIMAR...

In [9]:
query1 = """
SELECT 
    JobTitle,
    AVG(TotalPayBenefits) AS Avg_TotalPayBenefits
FROM Salaries
WHERE JobTitle NOT IN ('Not Provided', 'Not provided')
GROUP BY JobTitle
ORDER BY Avg_TotalPayBenefits DESC;
"""

df1 = pd.read_sql_query(query1, conn)
df1.head()

                                         JobTitle  Avg_TotalPayBenefits
0                        Chief Investment Officer         436224.360000
1                                 Chief of Police         411732.266667
2                          Chief, Fire Department         408865.326667
3  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY         399211.275000
4                      Gen Mgr, Public Trnsp Dept         380696.440000

In [10]:
query2 = """
SELECT 
    EmployeeName,
    JobTitle,
    OvertimePay
FROM Salaries
WHERE OvertimePay > 50000
ORDER BY OvertimePay DESC;
"""

df2 = pd.read_sql_query(query2, conn)
df2.head()

     EmployeeName                      JobTitle   OvertimePay
0    Not provided                  Not provided  Not Provided
1    Not provided                  Not provided  Not Provided
2    Not provided                  Not provided  Not Provided
3    Not provided                  Not provided  Not Provided
4  Gary Altenberg  Lieutenant, Fire Suppression     220909.48

In [11]:
query3 = """
SELECT 
    COUNT(DISTINCT EmployeeName) AS UniqueEmployees
FROM Salaries
WHERE EmployeeName NOT IN ('Not Provided', 'Not provided');
"""

df3 = pd.read_sql_query(query3, conn)
df3

   UniqueEmployees
0           110808

In [12]:
query4 = """
SELECT 
    EmployeeName,
    JobTitle,
    TotalPayBenefits
FROM Salaries
ORDER BY TotalPayBenefits DESC
LIMIT 10;
"""

df4 = pd.read_sql_query(query4, conn)
df4

,EmployeeName,JobTitle,TotalPayBenefits
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,567595.43
1,David Shinn,Deputy Chief 3,510732.68
2,Amy P Hart,Asst Med Examiner,479652.21
3,William J Coaker Jr.,Chief Investment Officer,436224.36
4,Gregory P Suhr,Chief of Police,425815.28
5,Joanne M Hayes-White,"Chief, Fire Department",422353.40
6,Gregory P Suhr,Chief of Police,418019.22
7,Joanne M Hayes-White,"Chief, Fire Department",417435.10
8,Ellen G Moffatt,Asst Med Examiner,415767.94
9,Gary Altenberg,"Lieutenant, Fire Suppression",407274.78

In [13]:
query5 = """
SELECT 
    EmployeeName,
    JobTitle,
    TotalPayBenefits
FROM Salaries
ORDER BY TotalPayBenefits DESC;
"""

df5 = pd.read_sql_query(query5, conn)
df5.head()

,EmployeeName,JobTitle,TotalPayBenefits
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,567595.43
1,David Shinn,Deputy Chief 3,510732.68
2,Amy P Hart,Asst Med Examiner,479652.21
3,William J Coaker Jr.,Chief Investment Officer,436224.36
4,Gregory P Suhr,Chief of Police,425815.28

In [14]:
conn.close()